INSERT INTO Patient (patientId, patientName, patientSurname, patientSex, patientBirthDate)

VALUES

  (1, 'Денис', 'Амитов', 'Мужской', '2003-02-01'),
  (2, 'Ксения', 'Васенина', 'Женский', '2012-01-10'),
  (3, 'София', 'Воронцова', 'Женский', '1999-03-20'),
  (4, 'Анна', 'Воронцова', 'Женский', '2004-06-17'),
  (5, 'Георгий', 'Герасимов', 'Мужской', '1980-06-25'),
  (6, 'Карина', 'Голант', 'Женский', '2000-11-25'),
  (7, 'Дарья', 'Ильина', '', '2005-06-01');

INSERT INTO Doctor (docId, docSurname, docSpecializationn, docCategory)

VALUES

  (1,  'Исаева', 'Психиатр', 'Вторая'),
  (2,  'Козлова', 'Кардиолог', 'Первая'),
  (3,  'Костынюк', 'Спортивный врач', 'Высшая'),
  (4,  'Кроян', 'Дерматолог', 'Высшая'),
  (5,  'Лобанова', 'Невролог', 'Первая'),
  (6,  'Лысак', 'Невролог', 'Вторая'),
  (7,  'Матюшенко', 'Анестезиолог', 'Вторая');


INSERT INTO Contacting (contactId, docId, patientId, contactPrice, contactDate)

VALUES

  (1, 3, 4, 300, '2025-11-23 12:00:00'),
  (2, 3, 5, 900, '2025-11-23 12:30:00'),
  (3, 6, 3, 500, '2025-11-23 12:30:00'),
  (4, 5, 1, 999, '2025-11-23 10:15:00'),
  (5, 4, 2, 891, '2025-11-23 17:45:00'),
  (6, 1, 7, 333, '2025-11-23 14:15:00'),
  (7, 2, 6, 888, '2025-11-23 16:20:00');